****** DONE create the csv file for the ocr4all directories to have the file name match the image name
:LOGBOOK:
CLOCK: [2025-03-23 Sun 23:20:44]--[2025-03-23 Sun 23:20:52] =>  00:00:08
:END:
****** DONE write "renamer" script to get files into the correct format
:LOGBOOK:
CLOCK: [2025-03-23 Sun 15:27:50]--[2025-03-23 Sun 15:27:53] =>  00:00:03
:END:
******** DONE test having gaps in the ocr4all files name list to see if it's even possible to have ocr4all work on pre-named files
********* DONE give ocr4all the "thibault-" prefixed names
:LOGBOOK:
CLOCK: [2025-03-25 Tue 09:57:24]--[2025-03-25 Tue 10:01:37] =>  00:04:13
:END:
********* DONE let ocr4all rename and do file conversions
********* DONE rename the ocr4all files to use the gapped image numbers
********** #cmd
```
python3 /mnt/c/Users/aquesnel/Dev/Thibault-images/ocr4all/data/Thibault/rename_files_batch.py -n -v /mnt/c/Users/aquesnel/Dev/Thibault-images/ocr4all/data/Thibault/Thibault-rename-pageToImageNumbering-missing.csv
```
********* DONE load the files in ocr4all
********* DONE merge all the ocr4all files into the same directory
********** DONE rename missing files to use image numbering
********** DONE rename original files to use image numbering
********** DONE merge directories
********* ocr4all is fine with having gaps in the file names, as long as the file names meet the naming convention of `####.png`
